use mermaid charts
